In [1]:
import pandas as pd
import os

In [3]:
path = 'C:\\Users\\PRECIOUS\\Desktop\\universal-2-1-0\\practice'

In [4]:
os.chdir(path)

In [5]:
os.listdir()

['all_student.csv', 'all_students.csv', 'README.txt']

In [37]:
data1 = pd.read_csv('all_student.csv')

In [39]:
data1.drop(1, inplace=True)

In [33]:
data = pd.DataFrame(data = data, columns = data.loc[0])

In [43]:
data1.columns = data.iloc[0]

In [50]:
data.iloc[0]
dataf = pd.DataFrame(data = data1, columns = data.iloc[0])

In [52]:
dataf

0                                                 NaN
0   | id | First Name | Last Name | Age |  State  ...
2   | 1  |  Micheal   |    Uche   |  22 |   Abia  ...
3   | 2  |   Ishola   |   Adams   |  18 |   Osun  ...
4   | 3  |   Grace    |   James   |  20 |  Lagos  ...
5   | 4  |   Adamu    |    Bala   |  22 |   Kano  ...
6   | 5  |  Gabriel   |   Ezikel  |  20 |   Abia  ...
7   | 6  |   Ngozie   |   Bright  |  21 | Anambra ...
8   | 7  |    Jude    |  Ogunowo  |  20 |  Lagos  ...
9   | 8  |    Mery    |   Okezie  |  21 |   Abia  ...
10  | 9  |  Jinjiri   |   Sadan   |  20 |   Kano  ...
11  | 10 |   Aisha    |   Oseni   |  23 |  Jigawa ...
12  +----+------------+-----------+-----+---------...